package Game;

public class Questions{
	public static String[] questions = 	{
			//1
			"ข้อใดคืออาณาเขตติดต่อของจังหวัดน่านด้านทิศเหนือ?",
			//2
			"ข้อใดคืออาณาเขตติดต่อของจังหวัดน่านด้านทิศใต้",
			//3
			"ข้อใดคืออาณาเขตติดต่อของจังหวัดน่านด้านทิศตะวันออก",
			//4
			"ข้อใดคืออาณาเขตติดต่อของจังหวัดน่านด้านทิศตะวันตก",
			//5
			"ข้อใดต่อไปนี้คือส่วนหนึ่งของคำขวัญของจังหวัดน่าน",
			//6
			"ข้อใดต่อไปนี้คือส่วนหนึ่งของคำขวัญของจังหวัดน่าน",
			//7
			"จังหวัดน่านตั้งอยู่ที่ภาคอะไร",
			//8
			"ดอกไม้ประจำจังหวัดน่านคือดอกอะไร",
			//9
			"ต้นไม้ประจำจังหวัดน่านคือต้นอะไร",
			//10
			"สถานที่ท่องเทียวไหน เป็นสถานที่ท่องเที่ยวของจัดหวัดน่าน",
			//11
			"อุทยานแห่งชาติแม่จริมมีกิจกรรมอะไรที่แนะนำ",
			//12
			"ข้อใดเป็นชื่ออุทยานแห่งชาติในจังหวัดน่าน",
			//13
			"วัดมิ่งเมืองตั้งอยู่ที่อำเภออะไร",
			//14
			"ข้อใดไม่ใช่สถานที่ท่องเที่ยวในจังหวัดน่าน",
			//15
			"การขนส่งในข้อใด ที่จังหวัดน่านไม่มี",
			//16
			"ผู้ว่าราชการจังหวัดน่านคนที่ 55 คือใคร",
			//17
			"จังหวัดน่านมีกี่อำเภอ",
			//18
			"ข้อใดต่อไปนี้เป็นส่วนหนึ่งของคำขวัญของอำเภอเมืองน่าน",
			//19
			"วัดพระธาตุช้างค้ำวรวิหาร มีอะไรโดดเด่น",
			//20
			"หอแสดงงานศิลปะขนาดใหญ่ ก่อตั้งและดำเนินการโดยศิลปินชาวน่าน วินัย ปราบริปู มีชื่อว่าอะไร",
			//21
			"ข้อใดต่อไปนี้เป็นส่วนหนึ่งของคำขวัญของอำเภอเมืองน่าน",
			//22
			"งานแข่งเรือประเพณีฉลองงาช้างดำจังหวัดน่านมีจุดเด่นคืออะไร",
			//23
			"งานแข่งเรือมีกี่ประเภทอะไรบ้าง",
			//24
			"งานเทศกาลส้มสีทองและงานกาชาดจังหวัดน่านเป็นเทศกาลที่จัดขึ้นเพื่ออะไร",
			//25
			"เทศกาลผ่อดอกชมพูภูคาเป็นเทศกาลที่มีข้อมูลเกี่ยวกับอะไร",
		
		};
	String	[][] options = 	{
			//1
			{"ติดกับจังหวัดเลย","ติดต่อกับประเทศพม่า","ติดต่อกับประเทศลาว","ติดกับจังหวัดอ่างทอง"},
			//2
			{"ติดกับจังหวัดพิษณุโลก","ติดต่อกับประเทศลาว","ติดกับจังหวัดสุโขทัย","ติดกับจังหวัดอุตรดิตถ์"},
			//3
			{"ติดกับจังหวัดเลย","ติดต่อกับประเทศลาว","ติดกับจังหวัดสกลนคร","ติดกับจังหวัดสมุทรปราการ"},
			//4
			{"ติดกับจังหวัดพะเยา","ติดกับจังหวัดอุบลราชธานี","ติดกับจังหวัดเชียงใหม่","ติดต่อกับประเทศพม่า"},
			//5
			{"แข่งเรือลือเลื่อง เมืองงาช้างเผือก จิตรกรรมวัดภูมินทร์","แข่งรถลือเลื่อง เมืองงาช้างดำ จิตรกรรมวัดภูมินทร์","แข่งเรือลือเลื่อง เมืองงาช้างดำ จิตรกรรมวัดภูมินทร์","แข่งเรือลือเลื่อง เมืองงาช้างเผือก จิตรกรรมวัดภูมินโฮ"},
			//6
			{"ดินแดนส้มสีทอง เรืองรองพระธาตุแช่แห้ง","แดนดินส้มสีทอง เรืองรองพระธาตุแช่แห้ง","แดนดินส้มสีทอง รองเรืองพระธาตุแช่แห้ง","ดินแดนส้มสีทอง รองเรืองพระธาตุแช่แห้ง"},
			//7
			{"ภาคเหนือ","ภาคตะวันตกเฉียงใต้","ภาคตะวันออกเฉียงเหนือ","ภาคกลาง"},
			//8
			{"ดอกทิวลิป","ดอกสารภี","ดอกสุพรรณิการ์","ดอกเสี้ยวดอกขาว"},
			//9
			{"ต้นกะซะลองคำ","ต้นโมกมัน","ต้นกำลังเสือโคร่ง","ต้นกัลปพฤกษ์"},
			//10
			{"ดอยเสมอดาว","ดอยภูคา","ดอยภูแว","ถูกทุกข้อ"},
			//11
			{"ล่องเรือใบลำน้ำว้า","ปีนเขา","ล่องแก่งลำน้ำว้า","ดำน้ำดูปะการัง"},
			//12
			{"อุทยานแห่งชาติขุนน่าน","อุทยานแห่งชาติเขาค้อ","อุทยานแห่งชาติขุนแผน","อุทยานแห่งชาติเมืองน่าน"},
			//13
			{"อำเภอปัว","อำเภอเวียงสา","อำเภอสองแคว","อำเภอเมืองน่าน"},
			//14
			{"วัดภูเก็ต","บ้านแม่กำปอง","วัดพระธาตุแช่แห้ง","ตลาดชายแดนบ้านห้วยโก๋น"},
			//15
			{"เครื่องบิน","รถยนต์ส่วนตัว","รถประจำทาง","รถไฟ"},
			//16
			{"นายวรกิตติ ศรีทิพากร","นายศุภกรณ์ วิมลรัตน์","นายสุวัฒน์ พรมสุวรรณ","นายอุกริช พึ่งโสภา"},
			//17
			{"15 อำเภอ และ 2 กิ่งอำเภอ","14 อำเภอ และ 1 กิ่งอำเภอ","13 อำเภอ และ 2 กิ่งอำเภอ","12 อำเภอ และ 1 กิ่งอำเภอ"},
			//18
			{"นมัสการพระธาตุเขาน้อย  แอ่วดอยภูพาน","นมัสการพระธาตุเขาใหญ่  แอ่วดอยภูพาน","นมัสการพระธาตุเขาน้อย  แอ่วดอยภูหลวง","นมัสการพระธาตุเขาใหญ่  แอ่วดอยภูหลวง"},
			//19
			{"พระธาตุขนาดใหญ่","รูปปั้นช้าง","เจดีย์ช้างค้ำ","รูปวาดภายในวัดเป็นรูปช้างเผือก"},
			//20
			{"หอศิลป์ริมน่าน","หอศิลป์เมืองน่าน","หอนาฬิกา","หอศิลป์ ณ น่าน"},
			//21
			{"บวงสรวงเสาหลักเมือง  ศิลปกรรมรุ่งเรืองตำนานเมืองน่าน","บวงสรวงเสาหลักเมือง  ศิลปกรรมรุ่งเรืองตำนานวัดเมืองน่าน","บวงสรวงเสาหลักเมือง  ศิลปกรรมรุ่งเรืองตำนานนครวัด","บวงสรวงเสาหลักเมือง  ศิลปกรรมรุ่งเรืองตำนานนครวัดเมืองน่าน"},
			//22
			{"เกิดขึ้นในงานตานก๋วยสลากและมีการทอดกฐินสามัคคี","เป็นงานเทพเจ้าช้างดำเพื่อเสริมสิริมงคล","เกิดขึ้นในงานทอดกฐิน","ไม่มีข้อถูก"},
			//23
			{"2 ประเภท เรือสวยงามและเรือเร็ว","2 ประเภท เรือเร็วและเรือขนส่ง","3 ประเภท เรือตกแต่ง เรือสวยงามและเรือเร็ว","3 ประเภท เรือขนส่ง เรือตกแต่งและเรือสวยงาม"},
			//24
			{"เป็นการอวดส้มสีทองของดีประจำจังหวัด","กล่าวถึงสรรพคุณของดินที่ทำให้ส้มเป็นสีทองสวยงาม","สารคาร์ทีนอยพิคเมนท์ในส้มเปลี่ยนไปในทางที่ดี","ถูกทุกข้อ"},
			//25
			{"จัดขึ้นที่วัดแช่แห้ง","จัดทำเพื่อให้ผู้คนสัมผัสวัฒนธรรมไทยลื้อ","เป็นเทศกาลที่จัดเพื่ออวดของดีของขึ้นชืื่อจังหวัดน่าน","จัดขึ้นช่วงปีใหม่"}
			
		
		};
	char[] answers = 		{
			//1
			'ค',
			//2
			'ง',
			//3
			'ข',
			//4
			'ก',
			//5
			'ค',
			//6
			'ข',
			//7
			'ก',
			//8
			'ง',
			//9
			'ค',
			//10
			'ง',
			//11
			'ค',
			//12
			'ก',
			//13
			'ง',
			//14
			'ข',
			//15
			'ง',
			//16
			'ก',
			//17
			'ข',
			//18
			'ค',
			//19
			'ค',
			//20
			'ก',
			//21
			'ข',
			//22
			'ก',
			//23
			'ก',
			//24
			'ง',
			//25
			'ข'
		};
	public String[] getquestions() {
        return questions.clone();
	}
	public char[] getanswer() {
        return answers.clone();
	}
}
